app/controllers/logins_controller.rb

SELECT * FROM `signups` WHERE (email = 'pravinmishra88' and password = 'pravink') LIMIT 1
---
  def create
		@signup = Signup.new(params[:userform])
		valid_user = Signup.find(:first,:conditions => ["email = ? and password = ?",@signup.email, @signup.password])