app/controllers/signups_controller.rb

SELECT * FROM `signups` WHERE (`signups`.`id` = 1)
---
  def show
    @signup = Signup.find(params[:id])

INSERT INTO `signups` (`last_name`, `created_at`, `updated_at`, `re_password`, `first_name`, `password`, `email`) VALUES('mishra', '2013-05-20 08:16:51', '2013-05-20 08:16:51', '123456', 'pravin', '123456', 'pravinmishra88@gmail.com')
---
  def create
    @signup = Signup.new(params[:signup])

    respond_to do |format|
      if @signup.save