app/controllers/stories_controller.rb

  def index
    @stories = Story.all
---
SELECT * FROM `stories`

  def show
    @story = Story.find(params[:id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)

  def edit
    @story = Story.find(params[:id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)

  def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save
---
INSERT INTO `stories` (`title`, `date_submit`, `count`, `image`, `des`, `created_at`, `updated_at`) VALUES('test', '2013-05-20', NULL, 'tset', '11111111111111111111111', '2013-05-20 08:17:23', '2013-05-20 08:17:23')

  def update
    @story = Story.find(params[:id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)

  def vote
    @story=Story.find(params[:id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)